# InsulationMaterial Properties

---
The InsulationMaterial type exposes the following members.
| Name| Description
---|---|---
| Id|  The Conductor Insulation Material id.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  The Conductor Insulation Material name.
Top
#### Reference
InsulationMaterial Class
Autodesk.Revit.DB.Electrical Namespace